Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.restore.help
source: Usage: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Replace this CLI process with the persisted surface process. New records preserve launch arguments and cwd as structured values; command-only records from older builds use a compatibility shell. With no id or ref, --surface uses the calling cmux surface.
ar: الاستخدام: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] استبدل عملية CLI هذه بعملية السطح المحفوظة. تحتفظ الـ سجلات الجديدة بوسائط التشغيل ودليل العمل الحالي (cwd) كقيم منظمة؛ وتستخدم السجلات التي تحتوي على الأوامر فقط من الإصدارات الأقدم غلاف توافق (compatibility shell). عند عدم وجود id أو ref، يستخدم --surface سطح cmux المستدعي.
bs: Upotreba: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Zamijeni ovaj CLI proces sačuvanim procesom površine. Novi zapisi čuvaju argumente pokretanja i cwd kao strukturirane vrijednosti; zapisi samo s naredbom iz starijih verzija koriste kompatibilnu ljusku. Ako id ili ref nisu navedeni, --surface koristi cmux površinu koja je pozvala naredbu.
da: Brug: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Erstat denne CLI-proces med den gemte overfladeproces. Nye poster bevarer startargumenter og cwd som strukturerede værdier; poster fra ældre builds, der kun indeholder en kommando, bruger en kompatibilitetsskal. Uden id eller ref bruger --surface den kaldende cmux-overflade.
de: Verwendung: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Ersetzt diesen CLI-Prozess durch den gespeicherten Surface-Prozess. Neue Datensätze bewahren Startargumente und cwd als strukturierte Werte auf; reine Befehlsdatensätze älterer Builds verwenden eine Kompatibilitäts-Shell. Ohne id oder ref verwendet --surface die aufrufende cmux-Surface.
es: Uso: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Reemplaza este proceso de CLI por el proceso de superficie guardado. Los registros nuevos conservan los argumentos de inicio y cwd como valores estructurados; los registros de compilaciones anteriores que solo contienen un comando usan un shell de compatibilidad. Sin id ni ref, --surface usa la superficie de cmux que realizó la llamada.
fr: Utilisation : cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Remplace ce processus CLI par le processus de la surface d'affichage persistée. Les nouveaux enregistrements préservent les arguments de lancement et le cwd sous forme de valeurs structurées ; les enregistrements contenant uniquement des commandes provenant de versions antérieures utilisent un interpréteur de commandes de compatibilité. Sans id ni ref, --surface utilise la surface d'affichage cmux appelante.
it: Uso: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Sostituisce questo processo CLI con il processo della superficie salvato. I nuovi record conservano gli argomenti di avvio e cwd come valori strutturati; i record delle versioni precedenti contenenti solo un comando usano una shell di compatibilità. Senza id o ref, --surface usa la superficie cmux chiamante.
ja: 使用法: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] この CLI プロセスを保存されたサーフェスプロセスで置き換えます。新しい レコードでは起動引数と cwd が構造化された値として保持されます。 旧ビルドのコマンドのみのレコードでは互換シェルを使用します。 id または ref を省略すると、--surface は呼び出し元の cmux サーフェスを使用します。
ko: 사용법: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] 이 CLI 프로세스를 유지된 화면 프로세스로 대체합니다. 새 기록은 시작 인수와 cwd를 구조화된 값으로 보존합니다; 이전 빌드의 명령 전용 기록은 호환성 셸을 사용합니다. id 또는 ref가 없으면, --surface는 호출한 cmux 화면을 사용합니다.
nb: Bruk: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Erstatt denne CLI-prosessen med den lagrede overflateprosessen. Nye oppføringer bevarer startargumenter og cwd som strukturerte verdier; oppføringer fra eldre bygg som bare inneholder en kommando, bruker et kompatibilitetsskall. Uten id eller ref bruker --surface den kallende cmux-overflaten.
pl: Użycie: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Zastępuje ten proces CLI zapisanym procesem powierzchni. Nowe rekordy zachowują argumenty uruchomienia i cwd jako wartości strukturalne; rekordy ze starszych kompilacji zawierające tylko polecenie używają powłoki zgodności. Bez id ani ref opcja --surface używa wywołującej powierzchni cmux.
pt_br: Uso: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Substitui este processo da CLI pelo processo de superfície persistido. Novos registros preservam os argumentos de inicialização e cwd como valores estruturados; registros de builds anteriores que contêm apenas um comando usam um shell de compatibilidade. Sem id ou ref, --surface usa a superfície do cmux que fez a chamada.
ru: Использование: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Заменяет этот процесс CLI сохранённым процессом поверхности. Новые записи сохраняют аргументы запуска и cwd как структурированные значения; записи старых сборок, содержащие только команду, используют оболочку совместимости. Если id или ref не указаны, --surface использует вызывающую поверхность cmux.
th: การใช้งาน: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] แทนที่โปรเซส CLI นี้ด้วยโปรเซสพื้นผิวที่บันทึกไว้ ระเบียนใหม่จะเก็บอาร์กิวเมนต์การเปิดใช้และ cwd เป็นค่าที่มีโครงสร้าง ส่วนระเบียนจากบิลด์เก่าที่มีเฉพาะคำสั่งจะใช้เชลล์เพื่อความเข้ากันได้ หากไม่ระบุ id หรือ ref ตัวเลือก --surface จะใช้พื้นผิว cmux ที่เรียกคำสั่ง
tr: Kullanım: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Bu CLI işlemini kalıcı yüzey işlemiyle değiştirir. Yeni kayıtlar başlatma bağımsız değişkenlerini ve cwd değerini yapılandırılmış değerler olarak korur; eski derlemelerdeki yalnızca komut içeren kayıtlar uyumluluk kabuğu kullanır. id veya ref verilmezse --surface, çağıran cmux yüzeyini kullanır.
uk: Використання: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] Замінює цей процес CLI збереженим процесом поверхні. Нові записи зберігають аргументи запуску та cwd як структуровані значення; записи старих збірок, що містять лише команду, використовують оболонку сумісності. Якщо id або ref не вказано, --surface використовує поверхню cmux, що викликала команду.
zh_hans: 用法: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] 将此 CLI 进程替换为持久化的表面进程。新的 记录将启动参数和 cwd 保留为结构化值； 来自较旧构建的仅命令记录使用兼容性 shell。 如果没有 id 或 ref，--surface 将使用发出调用的 cmux 表面。
zh_hant: 用法：cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id> cmux restore --surface [id|ref] 將此 CLI 程序取代為已保存的介面程序。新的 紀錄會將啟動引數和 cwd 保留為結構化值； 來自較舊組建的純指令紀錄則使用相容性 shell。 若無 id 或 ref，--surface 將使用呼叫的 cmux 介面。

# cli.restore.usage.positional
source: Usage: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
ar: الاستخدام: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
bs: Upotreba: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
da: Brug: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
de: Verwendung: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
es: Uso: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
fr: Utilisation : cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
it: Uso: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
ja: 使用法: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
ko: 사용법: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
nb: Bruk: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
pl: Użycie: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
pt_br: Uso: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
ru: Использование: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
th: การใช้งาน: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
tr: Kullanım: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
uk: Використання: cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
zh_hans: 用法：cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>
zh_hant: 用法：cmux restore [--surface <id|ref>] <kind> <checkpoint-id> cmux restore <kind> <checkpoint-id> --surface <id|ref> cmux restore --surface=<id|ref> <kind> <checkpoint-id>

# cli.restore.usage.surface
source: Usage: cmux restore --surface [id|ref]
ar: الاستخدام: cmux restore --surface [id|ref]
de: Verwendung: cmux restore --surface [id|ref]
es: Uso: cmux restore --surface [id|ref]
fr: Utilisation : cmux restore --surface [id|ref]
ja: 使用法: cmux restore --surface [id|ref]
ko: 사용법: cmux restore --surface [id|ref]
zh_hans: 用法：cmux restore --surface [id|ref]
zh_hant: 用法：cmux restore --surface [id|ref]

# cli.rightSidebar.error.invalidWindow
source: Invalid window handle: %@
ar: مقبض نافذة غير صالح: %@
de: Ungültiger Fenster-Handle: %@
es: Identificador de ventana no válido: %@
fr: Descripteur de fenêtre invalide : %@
ja: 無効なウィンドウ指定: %@
ko: 유효하지 않은 창 핸들: %@
zh_hans: 无效的窗口句柄：%@
zh_hant: 無效的視窗控制代碼：%@

# cli.rightSidebar.error.invalidWorkspace
source: Invalid workspace handle: %@
ar: مقبض مساحة عمل غير صالح: %@
de: Ungültiger Arbeitsbereich-Handle: %@
es: Identificador de espacio de trabajo no válido: %@
fr: Descripteur d'espace de travail invalide : %@
ja: 無効なワークスペース指定: %@
ko: 유효하지 않은 작업 공간 핸들: %@
zh_hans: 无效的工作区句柄：%@
zh_hant: 無效的工作區控制代碼：%@

# cli.rightSidebar.error.missingCommand
source: right-sidebar requires a subcommand
ar: يتطلب right-sidebar أمرًا فرعيًا
de: right-sidebar erfordert einen Unterbefehl
es: right-sidebar requiere un subcomando
fr: right-sidebar requiert une sous-commande
ja: right-sidebar にはサブコマンドが必要です
ko: right-sidebar에는 하위 명령이 필요합니다.
zh_hans: right-sidebar 需要一个子命令
zh_hant: right-sidebar 需要子指令

# cli.rightSidebar.error.noFocusOnlySet
source: right-sidebar: --no-focus is only valid with set
ar: right-sidebar: الخيار --no-focus صالح فقط مع set
de: right-sidebar: --no-focus ist nur mit set gültig
es: right-sidebar: --no-focus solo es válido con set
fr: right-sidebar : --no-focus est valide uniquement avec set
ja: right-sidebar: --no-focus は set でのみ使えます
ko: right-sidebar: --no-focus는 set에서만 유효합니다.
zh_hans: right-sidebar：--no-focus 仅在与 set 一起使用时有效
zh_hant: right-sidebar: --no-focus 僅在搭配 set 時有效

# cli.rightSidebar.error.setRequiresMode
source: right-sidebar set requires a mode: files, find, vault, sessions, feed, dock, cloud, or custom [sidebar-name]
ar: يتطلب أمر right-sidebar set وضعًا: files، أو find، أو vault، أو sessions، أو feed، أو dock، أو cloud، أو custom [sidebar-name]
de: right-sidebar set erfordert einen Modus: files, find, vault, sessions, feed, dock, cloud oder custom [Seitenleisten-Name]
es: right-sidebar set requiere un modo: files, find, vault, sessions, feed, dock, cloud o custom [sidebar-name]
fr: right-sidebar set requiert un mode : files, find, vault, sessions, feed, dock, cloud ou custom [nom-barre-latérale]
ja: right-sidebar set にはモードが必要です: files, find, vault, sessions, feed, dock, cloud, custom [sidebar-name]
ko: right-sidebar set에는 다음 모드 중 하나가 필요합니다: files, find, vault, sessions, feed, dock, cloud 또는 custom [sidebar-name]
zh_hans: right-sidebar set 需要一个模式：files、find、vault、sessions、feed、dock、cloud 或 custom [sidebar-name]
zh_hant: right-sidebar set 需要模式：files、find、vault、sessions、feed、dock、cloud 或 custom [sidebar-name]

# cli.rightSidebar.error.unexpectedArguments
source: right-sidebar %@ received unexpected arguments
ar: تلقى right-sidebar %@ وسائط غير متوقعة
de: right-sidebar %@ hat unerwartete Argumente empfangen
es: right-sidebar %@ recibió argumentos inesperados
fr: right-sidebar %@ a reçu des arguments inattendus
ja: right-sidebar %@ に予期しない引数があります
ko: right-sidebar %@에 예상치 못한 인수가 전달되었습니다.
zh_hans: right-sidebar %@ 收到了意外参数
zh_hant: right-sidebar %@ 收到未預期的引數

# cli.rightSidebar.error.unknownCommand
source: Unknown right-sidebar command '%@'
ar: أمر right-sidebar غير معروف '%@'
de: Unbekannter right-sidebar-Befehl „%@“
es: Comando right-sidebar desconocido '%@'
fr: Commande right-sidebar inconnue '%@'
ja: 不明な right-sidebar コマンド '%@'
ko: 알 수 없는 right-sidebar 명령 '%@'
zh_hans: 未知的 right-sidebar 命令 '%@'
zh_hant: 未知的 right-sidebar 指令 '%@'

# cli.rightSidebar.error.unknownFlag
source: right-sidebar: unknown flag '%@'
ar: right-sidebar: علم غير معروف '%@'
de: right-sidebar: unbekanntes Flag „%@“
es: right-sidebar: opción desconocida '%@'
fr: right-sidebar : option inconnue '%@'
ja: right-sidebar: 不明なフラグ '%@'
ko: right-sidebar: 알 수 없는 플래그 '%@'
zh_hans: right-sidebar：未知标志 '%@'
zh_hant: right-sidebar: 未知的旗標 '%@'

# cli.rightSidebar.error.unknownMode
source: Unknown right-sidebar mode '%@'
ar: وضع شريط جانبي أيمن غير معروف '%@'
de: Unbekannter right-sidebar-Modus „%@“
es: Modo de right-sidebar desconocido '%@'
fr: Mode right-sidebar inconnu '%@'
ja: 不明な right-sidebar モード '%@'
ko: 알 수 없는 right-sidebar 모드 '%@'
zh_hans: 未知的 right-sidebar 模式 '%@'
zh_hant: 未知的 right-sidebar 模式 '%@'

# cli.rightSidebar.error.windowRefNotFound
source: Window ref not found
ar: لم يتم العثور على مرجع النافذة
de: Fenster-Ref nicht gefunden
es: Referencia de ventana no encontrada
fr: Référence de fenêtre non trouvée
ja: ウィンドウ参照が見つかりません
ko: 창 참조를 찾을 수 없습니다.
zh_hans: 未找到窗口引用
zh_hant: 找不到視窗參考

# cli.rightSidebar.error.windowRequiresValue
source: right-sidebar: --window requires an id
ar: right-sidebar: يتطلب الخيار --window معرفًا
de: right-sidebar: --window erfordert eine ID
es: right-sidebar: --window requiere un id
fr: right-sidebar : --window requiert un identifiant
ja: right-sidebar: --window には ID が必要です
ko: right-sidebar: --window에 ID가 필요합니다
zh_hans: right-sidebar：--window 需要一个 id
zh_hant: right-sidebar: --window 需要 id

# cli.rightSidebar.error.workspaceRefNotFound
source: Workspace ref not found
ar: لم يتم العثور على مرجع مساحة العمل
de: Arbeitsbereichs-Ref nicht gefunden
es: Referencia de espacio de trabajo no encontrada
fr: Référence d'espace de travail non trouvée
ja: ワークスペース参照が見つかりません
ko: 작업 공간 참조를 찾을 수 없습니다
zh_hans: 未找到工作区引用
zh_hant: 找不到工作區參考

# cli.rightSidebar.error.workspaceRequiresValue
source: right-sidebar: --workspace requires an id
ar: right-sidebar: يتطلب الخيار --workspace معرفًا
de: right-sidebar: --workspace erfordert eine ID
es: right-sidebar: --workspace requiere un id
fr: right-sidebar : --workspace requiert un identifiant
ja: right-sidebar: --workspace には ID が必要です
ko: right-sidebar: --workspace에 ID가 필요합니다
zh_hans: right-sidebar：--workspace 需要一个 id
zh_hant: right-sidebar: --workspace 需要 id
